Revit 2027 API
DocumentDifference.GetCreatedElementIds Method
 Created element id collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetCreatedElementIds()
Public Function GetCreatedElementIds As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetCreatedElementIds()
member GetCreatedElementIds : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
See Also
Reference
DocumentDifference Class
Autodesk.Revit.DB Namespace